old notes from emacs/old/org/2015InternPresi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2015-05-12 Tue 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Leo Ufimtsev" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline49">1. <span class="todo nilTODO">TODO</span> make Intern presentation</a>
<ul>
<li><a href="#orgheadline5">1.1. What is Eclipse develeopment</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Eclipse core and plugins.</a></li>
<li><a href="#orgheadline2">1.1.2. CDT is a plugin.</a></li>
<li><a href="#orgheadline3">1.1.3. SWT is what it's build on.</a></li>
<li><a href="#orgheadline4">1.1.4. C/Java side.</a></li>
</ul>
</li>
<li><a href="#orgheadline19">1.2. Things I've done</a>
<ul>
<li><a href="#orgheadline9">1.2.1. Releng tools</a></li>
<li><a href="#orgheadline11">1.2.2. CDT Development</a></li>
<li><a href="#orgheadline15">1.2.3. SWT Deveolpment</a></li>
<li><a href="#orgheadline18">1.2.4. Documentation</a></li>
</ul>
</li>
<li><a href="#orgheadline22">1.3. Bragging rights</a>
<ul>
<li><a href="#orgheadline20">1.3.1. Wrote blog got a sweater.</a></li>
<li><a href="#orgheadline21">1.3.2. Wrote entry on finding memory leaks in java, 12,000+ k views (150 views yesterday, top of the list -&gt; Got Wind breaker.</a></li>
</ul>
</li>
<li><a href="#orgheadline30">1.4. What you will learn</a>
<ul>
<li><a href="#orgheadline23">1.4.1. Java</a></li>
<li><a href="#orgheadline24">1.4.2. Debugging skills</a></li>
<li><a href="#orgheadline25">1.4.3. Reverse engineering (More code reading than writing)</a></li>
<li><a href="#orgheadline26">1.4.4. Graphics library, SWT. Eclipse framework PlatformUI,</a></li>
<li><a href="#orgheadline27">1.4.5. C / Gtk/Gdk</a></li>
<li><a href="#orgheadline28">1.4.6. bash (for your own)</a></li>
<li><a href="#orgheadline29">1.4.7. IDE - Eclipse in depth.</a></li>
</ul>
</li>
<li><a href="#orgheadline40">1.5. Why join eclipse</a>
<ul>
<li><a href="#orgheadline31">1.5.1. Learn a lot.</a></li>
<li><a href="#orgheadline32">1.5.2. Learn incrementally.</a></li>
<li><a href="#orgheadline33">1.5.3. Understanding of large libraries, constructs.</a></li>
<li><a href="#orgheadline34">1.5.4. Not stressfull, you get time to think and ponder.</a></li>
<li><a href="#orgheadline35">1.5.5. Report on weekly meeting.</a></li>
<li><a href="#orgheadline36">1.5.6. No scrum, just thought.</a></li>
<li><a href="#orgheadline37">1.5.7. Team members are (mostly) local, very helpful.</a></li>
<li><a href="#orgheadline38">1.5.8. Involved with community, twitter, bugzilla triage,</a></li>
<li><a href="#orgheadline39">1.5.9. Red Hat is intreseted in Eclipse development, bright future.</a></li>
</ul>
</li>
<li><a href="#orgheadline48">1.6. Insights</a>
<ul>
<li><a href="#orgheadline41">1.6.1. Ask for help if you're not making progress.</a></li>
<li><a href="#orgheadline42">1.6.2. Learn an editor. (Emacs obviously).</a></li>
<li><a href="#orgheadline43">1.6.3. Be proffesional</a></li>
<li><a href="#orgheadline44">1.6.4. Things to learn:</a></li>
<li><a href="#orgheadline45">1.6.5. Subscribe to RSS feeds (e.g via feedy), relevant topics.</a></li>
<li><a href="#orgheadline46">1.6.6. Use twitter, tweetdeck. Folow few but relevant people in your project.</a></li>
<li><a href="#orgheadline47">1.6.7. Contact</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline49" class="outline-2">
<h2 id="orgheadline49"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> make Intern presentation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.1</span> What is Eclipse develeopment</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Eclipse core and plugins.</h4>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> CDT is a plugin.</h4>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> SWT is what it's build on.</h4>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.1.4</span> C/Java side.</h4>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">1.2</span> Things I've done</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.2.1</span> Releng tools</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="orgheadline6"></a>About<br  /><div class="outline-text-5" id="text-1-2-1-1">
<p>
2000 lines of code
Plug in
</p>
</div></li>
<li><a id="orgheadline7"></a>Stabilize<br  /></li>
<li><a id="orgheadline8"></a>Improve performance<br  /></li></ol>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.2.2</span> CDT Development</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="orgheadline10"></a>Added a checkbox<br  /><div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>different thing depending on Autotools/Makefile/Managed Make</li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">1.2.3</span> SWT Deveolpment</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="orgheadline12"></a>Rewrote/patched up SWT DateTime.<br  /></li>
<li><a id="orgheadline13"></a>DnD, breadcrums throughout the whole SWT code base.<br  /></li>
<li><a id="orgheadline14"></a>Styple fixes, (e.g background color)<br  /></li></ol>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">1.2.4</span> Documentation</h4>
<div class="outline-text-4" id="text-1-2-4">
</div><ol class="org-ol"><li><a id="orgheadline16"></a>SWT-dev guide<br  /></li>
<li><a id="orgheadline17"></a>Blog<br  /></li></ol>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">1.3</span> Bragging rights</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">1.3.1</span> Wrote blog got a sweater.</h4>
</div>
<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">1.3.2</span> Wrote entry on finding memory leaks in java, 12,000+ k views (150 views yesterday, top of the list -&gt; Got Wind breaker.</h4>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">1.4</span> What you will learn</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">1.4.1</span> Java</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Like back of your hand
</p>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">1.4.2</span> Debugging skills</h4>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">1.4.3</span> Reverse engineering (More code reading than writing)</h4>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">1.4.4</span> Graphics library, SWT. Eclipse framework PlatformUI,</h4>
</div>
<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">1.4.5</span> C / Gtk/Gdk</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Like back of your calf
</p>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">1.4.6</span> bash (for your own)</h4>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">1.4.7</span> IDE - Eclipse in depth.</h4>
<div class="outline-text-4" id="text-1-4-7">
<p>
Industry standard. - E.g Air miles.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">1.5</span> Why join eclipse</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">1.5.1</span> Learn a lot.</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Not repetative.</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">1.5.2</span> Learn incrementally.</h4>
</div>
<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">1.5.3</span> Understanding of large libraries, constructs.</h4>
</div>
<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">1.5.4</span> Not stressfull, you get time to think and ponder.</h4>
</div>
<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">1.5.5</span> Report on weekly meeting.</h4>
</div>
<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">1.5.6</span> No scrum, just thought.</h4>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">1.5.7</span> Team members are (mostly) local, very helpful.</h4>
</div>
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">1.5.8</span> Involved with community, twitter, bugzilla triage,</h4>
</div>
<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">1.5.9</span> Red Hat is intreseted in Eclipse development, bright future.</h4>
<div class="outline-text-4" id="text-1-5-9">
<ul class="org-ul">
<li>Red hat now strategic member of Eclipse foundation (250,000$ anually).
<a href="https://www.eclipse.org/org/press-release/20150505_redhat.php?utm_source=twitterfeed&amp;utm_medium=twitter&amp;utm_campaign=Feed:+eclipse/fnews+(Eclipse+Foundation+News)">https://www.eclipse.org/org/press-release/20150505_redhat.php?utm_source=twitterfeed&amp;utm_medium=twitter&amp;utm_campaign=Feed:+eclipse/fnews+(Eclipse+Foundation+News)</a></li>
<li>Really good for C development. Industry standard.</li>
<li>C + something on top development.</li>
<li>Eclipse is old, (but so is Vim &amp; Emacs). I'd say Eclipse is mature.</li>
<li>Underlying framework is updated and re-worked on. New features added. (e.g split view, dark theme improvements).</li>
<li>Other editors are more like Mac/Windows. You get what that company wants. Eclipse is what community wants.</li>
<li>Active Docker development.</li>
<li>Bright future ahead.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">1.6</span> Insights</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">1.6.1</span> Ask for help if you're not making progress.</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li>after 1 hour, 1 day, 1 week. When you feel stuck.</li>
<li>When something doesn't work as you'd expect</li>
</ul>

<p>
E.g was trying to figure out C-debugging, was stuck for 3 days. 
Roland helped me fix it in like 30 minutes.
</p>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">1.6.2</span> Learn an editor. (Emacs obviously).</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>Emacs is like lego. You build what you want. Tailor to your needs.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">1.6.3</span> Be proffesional</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
I used to add ascii art to my reports. Not any more.
</p>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-4">
<h4 id="orgheadline44"><span class="section-number-4">1.6.4</span> Things to learn:</h4>
<div class="outline-text-4" id="text-1-6-4">
<ul class="org-ul">
<li>Spend 1-3 days learning git. 
Command line version is your friend. Then the IDE version is your loyal servant.</li>
<li>30 mins/day, learn something new.</li>
<li>Book: Clean Code.
Changes the way you think about code. About how you take notes.</li>
<li>Book: on Java (whole, not just article).
e.g you come back later to things you read in the book. E.g threading, annotations.</li>
<li>Book on C if you do C development.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">1.6.5</span> Subscribe to RSS feeds (e.g via feedy), relevant topics.</h4>
<div class="outline-text-4" id="text-1-6-5">
<p>
E.g I subsribe to Gtk, learned about GtkInspector, fixed DnD problem that I was stuck on for 3 weeks.
</p>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-4">
<h4 id="orgheadline46"><span class="section-number-4">1.6.6</span> Use twitter, tweetdeck. Folow few but relevant people in your project.</h4>
</div>
<div id="outline-container-orgheadline47" class="outline-4">
<h4 id="orgheadline47"><span class="section-number-4">1.6.7</span> Contact</h4>
<div class="outline-text-4" id="text-1-6-7">
<p>
Leo Ufimtsev
</p>

<p>
lufimtse@redhat.com
</p>

<p>
LeoUfimtsev (irc)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Leo Ufimtsev</p>
<p class="date">Created: 2015-05-12 Tue 17:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
